import React from "react";
import {Field} from "redux-form";

import {TitleIcon, RenderInput, RenderTextarea} from "../../../";

const ObjectsNewModalsFaqItem: React.FC<any> = ({fields}) => {
    React.useEffect(() => {
        fields.push({});
    }, []);

    const addField = () => {
        fields.push({});
    };

    return (
        <>
            {fields.map((item: any, index: number) => (
                <div
                    className="objects-new-modal-content-big-faq-item"
                    key={`objects-new-modal-content-big-faq-item-${index}`}
                >
                    <h3 className="objects-new-modal-content-big-faq-item__title">
                        Вопрос-ответ №{index + 1}
                    </h3>

                    <div className="objects-new-modal-content-big-faq-item-question">
                        <TitleIcon title="Вопрос" marginBottom>
                            <svg
                                viewBox="0 0 20 20"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M19.9998 13.5352C19.9998 11.0533 18.576 8.83835 16.4436 7.76093C16.3774 12.5195 12.5193 16.3776 7.76074 16.4438C8.83817 18.5762 11.0531 20 13.535 20C14.6986 20 15.8302 19.6901 16.8245 19.1013L19.9716 19.9718L19.1011 16.8246C19.6899 15.8304 19.9998 14.6988 19.9998 13.5352V13.5352Z"
                                    fill="#00A0A0"
                                />
                                <path
                                    d="M15.2734 7.63672C15.2734 3.42575 11.8477 0 7.63672 0C3.42575 0 0 3.42575 0 7.63672C0 9.00909 0.365295 10.3453 1.05896 11.5184L0.0280762 15.2452L3.75504 14.2145C4.92813 14.9081 6.26434 15.2734 7.63672 15.2734C11.8477 15.2734 15.2734 11.8477 15.2734 7.63672ZM6.46484 5.85938H5.29297C5.29297 4.56696 6.3443 3.51562 7.63672 3.51562C8.92914 3.51562 9.98047 4.56696 9.98047 5.85938C9.98047 6.51535 9.70276 7.14584 9.21829 7.58896L8.22266 8.50021V9.41406H7.05078V7.98416L8.42712 6.7244C8.6731 6.49933 8.80859 6.19217 8.80859 5.85938C8.80859 5.21317 8.28293 4.6875 7.63672 4.6875C6.99051 4.6875 6.46484 5.21317 6.46484 5.85938ZM7.05078 10.5859H8.22266V11.7578H7.05078V10.5859Z"
                                    fill="#00A0A0"
                                />
                            </svg>
                        </TitleIcon>

                        <Field
                            component={RenderInput}
                            type="text"
                            label="Например, платные ли полотенца?"
                            small
                            name={`${item}.title`}
                        />
                    </div>
                    <div className="objects-new-modal-content-big-faq-item-answer">
                        <TitleIcon title="Ответ на вопрос" marginBottom>
                            <svg
                                viewBox="0 0 20 20"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M10 0C4.48591 0 0 4.03817 0 9.00154C0.0253839 10.2994 0.330345 11.5731 0.890854 12.7225C1.45136 13.8718 2.25211 14.8653 3.23 15.6246C2.90666 16.7044 2.42637 17.7221 1.80701 18.6399C1.74751 18.7385 1.70966 18.8504 1.69633 18.9671C1.683 19.0839 1.69453 19.2023 1.73007 19.3135C1.7656 19.4247 1.8242 19.5257 1.90141 19.6089C1.97861 19.692 2.07241 19.7552 2.17566 19.7935C2.54422 19.929 2.93087 19.9988 3.32034 20C5.13988 20 6.49172 18.4289 7.07556 17.6035C8.03083 17.869 9.01342 18.0035 10 18.0038C15.5141 18.0038 20 13.9657 20 9.00158C20 4.03817 15.5141 0 10 0ZM14.4664 6.6584L9.90234 12.2737C9.66442 12.5646 9.33359 12.7484 8.97556 12.7888C8.61753 12.8291 8.2585 12.723 7.96979 12.4915L5.64279 10.6124C5.49127 10.49 5.39112 10.3079 5.36437 10.106C5.33762 9.90407 5.38646 9.699 5.50014 9.53588C5.61383 9.37275 5.78304 9.26493 5.97056 9.23612C6.15809 9.20732 6.34856 9.25991 6.50007 9.3823L8.82743 11.2613L13.3908 5.64605C13.4524 5.56966 13.5275 5.50713 13.6116 5.46202C13.6957 5.41691 13.7873 5.39013 13.8811 5.3832C13.9748 5.37627 14.069 5.38933 14.158 5.42163C14.2471 5.45393 14.3294 5.50485 14.4001 5.57145C14.4709 5.63805 14.5288 5.71903 14.5704 5.80975C14.612 5.90047 14.6366 5.99915 14.6428 6.10012C14.649 6.2011 14.6365 6.30239 14.6063 6.39819C14.576 6.49399 14.5285 6.58242 14.4664 6.6584Z"
                                    fill="#00A0A0"
                                />
                            </svg>
                        </TitleIcon>

                        <Field
                            component={RenderTextarea}
                            label="Полотенца включены в стоимость проживания"
                            name={`${item}.text`}
                        />
                    </div>
                </div>
            ))}

            <button
                type="button"
                className="objects-new-modal-content-big-faq__btn"
                onClick={addField}
            >
                <svg
                    width="36"
                    height="36"
                    viewBox="0 0 36 36"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M34.25 18.125C34.25 9.22266 27.0273 2 18.125 2C9.22266 2 2 9.22266 2 18.125C2 27.0273 9.22266 34.25 18.125 34.25C27.0273 34.25 34.25 27.0273 34.25 18.125Z"
                        stroke="#116E67"
                        strokeWidth="3"
                        strokeMiterlimit="10"
                    />
                    <path
                        d="M18.1248 25.7264V10.5236M25.7262 18.125H10.5234H25.7262Z"
                        stroke="#116E67"
                        strokeWidth="3"
                        strokeLinecap="round"
                        strokeLinejoin="round"
                    />
                </svg>
                Добавить еще вопрос-ответ
            </button>
        </>
    );
};

export default ObjectsNewModalsFaqItem;
