import React from "react";

const HomeSteps: React.FC = () => {
    return (
        <section className="home-steps">
            <div className="container">
                <div className="home-steps-wrapper">
                    <div className="home-steps-block">
                        <div className="home-steps-block-icon">
                            <svg
                                viewBox="0 0 80 159"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M80 0V159H36.2205V39.75H35.2756L0 60.5566V23.9121L39.685 0H80Z"
                                    fill="#00A0A0"
                                    fillOpacity="0.3"
                                />
                            </svg>
                        </div>
                        <div className="home-steps-block-text">
                            <h3 className="home-steps-block-text__title">
                                Зарегистрируйтесь
                            </h3>
                            <p className="home-steps-block-text__description">
                                Пройдите простую первичную регистрацию в
                                несколько пунктов и получите доступ к панели
                                управления
                            </p>
                        </div>
                    </div>
                    <div className="home-steps-block">
                        <div className="home-steps-block-icon">
                            <svg
                                viewBox="0 0 124 159"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M3.07692 159V128.364L61.8462 79.9595C65.7436 76.7428 69.0769 73.7303 71.8462 70.922C74.6667 68.0626 76.8205 65.1267 78.3077 62.1142C79.8462 59.1016 80.6154 55.7572 80.6154 52.0809C80.6154 48.0472 79.7436 44.6007 78 41.7413C76.3077 38.882 73.9487 36.6864 70.9231 35.1546C67.8974 33.5718 64.4103 32.7803 60.4615 32.7803C56.5128 32.7803 53.0256 33.5718 50 35.1546C47.0256 36.7375 44.7179 39.0607 43.0769 42.1243C41.4359 45.1879 40.6154 48.9152 40.6154 53.3064H0C0 42.2775 2.48718 32.7803 7.46154 24.815C12.4359 16.8497 19.4615 10.7225 28.5385 6.43353C37.6154 2.14451 48.2564 0 60.4615 0C73.0769 0 84 2.01686 93.2308 6.05058C102.513 10.0332 109.667 15.6498 114.692 22.9003C119.769 30.1508 122.308 38.6522 122.308 48.4046C122.308 54.4297 121.051 60.4292 118.538 66.4032C116.026 72.3261 111.513 78.8873 105 86.0867C98.4872 93.2861 89.2308 101.864 77.2308 111.821L62.4615 124.075V124.994H124V159H3.07692Z"
                                    fill="#00A0A0"
                                    fillOpacity="0.3"
                                />
                            </svg>
                        </div>
                        <div className="home-steps-block-text">
                            <h3 className="home-steps-block-text__title">
                                Создайте объект
                            </h3>
                            <p className="home-steps-block-text__description">
                                Детальная, но понятная настройка объекта
                                позволит учесть основные факторы для ваших
                                будущих гостей
                            </p>
                        </div>
                    </div>
                    <div className="home-steps-block">
                        <div className="home-steps-block-icon">
                            <svg
                                viewBox="0 0 127 159"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M62.7447 159C50.5778 159 39.7685 156.909 30.3165 152.728C20.9149 148.496 13.5243 142.677 8.14474 135.271C2.76519 127.865 0.0502761 119.351 0 109.728H42.232C42.2823 112.701 43.1872 115.371 44.9469 117.739C46.7569 120.056 49.2204 121.87 52.3375 123.18C55.4546 124.49 59.0242 125.144 63.0463 125.144C66.9176 125.144 70.3364 124.464 73.3027 123.104C76.269 121.693 78.5817 119.754 80.2408 117.285C81.8999 114.817 82.7043 111.995 82.654 108.821C82.7043 105.698 81.7491 102.927 79.7883 100.509C77.8778 98.0903 75.188 96.201 71.719 94.8408C68.2499 93.4805 64.253 92.8004 59.7281 92.8004H44.0419V63.7814H59.7281C63.901 63.7814 67.5712 63.1012 70.7386 61.741C73.9563 60.3807 76.4449 58.4914 78.2046 56.0732C80.0145 53.6549 80.8944 50.884 80.8441 47.7604C80.8944 44.7376 80.1654 42.0675 78.6571 39.75C77.1488 37.4325 75.0372 35.6188 72.3223 34.3089C69.6576 32.999 66.5657 32.3441 63.0463 32.3441C59.2253 32.3441 55.8066 33.0242 52.79 34.3845C49.8237 35.7448 47.4859 37.634 45.7765 40.0523C44.0671 42.4705 43.1872 45.2414 43.137 48.365H3.01657C3.06685 38.8935 5.65607 30.5304 10.7842 23.2757C15.9627 16.0209 23.0516 10.3279 32.0511 6.19677C41.0505 2.06559 51.3823 0 63.0463 0C74.459 0 84.5394 1.93964 93.2874 5.81892C102.086 9.69819 108.948 15.0385 113.876 21.8398C118.853 28.5908 121.316 36.3241 121.266 45.0399C121.367 53.7053 118.4 60.8089 112.367 66.3508C106.384 71.8926 98.7927 75.1673 89.5921 76.1749V77.384C102.061 78.7443 111.437 82.5732 117.722 88.8707C124.006 95.1179 127.098 102.977 126.998 112.449C127.048 121.517 124.333 129.553 118.853 136.556C113.423 143.558 105.856 149.05 96.1532 153.03C86.5002 157.01 75.364 159 62.7447 159Z"
                                    fill="#00A0A0"
                                    fillOpacity="0.3"
                                />
                            </svg>
                        </div>
                        <div className="home-steps-block-text">
                            <h3 className="home-steps-block-text__title">
                                Верифицируйтесь
                            </h3>
                            <p className="home-steps-block-text__description">
                                Осталось совсем немного: необходимо пройти
                                простую верификацию, что объект был одобрен
                                модерацией
                            </p>
                        </div>
                    </div>
                    <div className="home-steps-block">
                        <div className="home-steps-block-icon">
                            <svg
                                viewBox="0 0 138 159"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                    d="M0 134.156V100.617L64.4626 0H95.1292V44.7187H77.6054L42.8707 99.375V100.617H138V134.156H0ZM77.9184 159V123.908L78.8571 109.312V0H119.537V159H77.9184Z"
                                    fill="#00A0A0"
                                    fillOpacity="0.3"
                                />
                            </svg>
                        </div>
                        <div className="home-steps-block-text">
                            <h3 className="home-steps-block-text__title">
                                Подпишите договор
                            </h3>
                            <p className="home-steps-block-text__description">
                                Всё! Мы прислали Вам договор, чтобы Вы могли
                                получать доход от сдачи в аренду. Осталось
                                только подписать.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default HomeSteps;
