import React from "react";

const ObjectsNewAbout: React.FC = () => {
    return (
        <div className="objects-new-block objects-new-block-about">
            <div className="objects-new-block-text">
                <h2 className="objects-new-block-text__title">Об объекте</h2>
                <p className="objects-new-block-text__description">
                    Расскажите об отеле, о его достоинствах, преимуществах,
                    истории. Помимо этого, в этом блоке будут отображаться самые
                    популярные удобства и услуги, когда вы заполните карточку
                    удобств.
                </p>
                <button className="btn-line objects-new-block-text__btn">
                    Добавить информацию
                </button>
            </div>

            <div className="objects-new-block-icon">
                <svg
                    width="216"
                    height="216"
                    viewBox="0 0 216 216"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M128.25 0H24.75C11.07 0 0 11.07 0 24.75V164.25C0 177.93 11.07 189 24.75 189H84.06C79.2 178.74 76.5 167.31 76.5 155.25C76.5 144.9 78.48 135 82.17 125.91C81.81 126 81.45 126 81 126H36C31.05 126 27 121.95 27 117C27 112.05 31.05 108 36 108H81C84.42 108 87.48 109.98 88.92 112.86C94.77 103.77 102.33 96.03 111.24 90H36C31.05 90 27 85.95 27 81C27 76.05 31.05 72 36 72H117C121.95 72 126 76.05 126 81C126 81.45 126 81.81 125.91 82.17C134.28 78.75 143.46 76.77 153 76.59V24.75C153 11.07 141.93 0 128.25 0V0ZM72 54H36C31.05 54 27 49.95 27 45C27 40.05 31.05 36 36 36H72C76.95 36 81 40.05 81 45C81 49.95 76.95 54 72 54Z"
                        fill="#00A0A0"
                        fillOpacity="0.2"
                    />
                    <path
                        d="M155.25 94.5C121.752 94.5 94.5 121.752 94.5 155.25C94.5 188.748 121.752 216 155.25 216C188.748 216 216 188.748 216 155.25C216 121.752 188.748 94.5 155.25 94.5ZM180 164.25H164.25V180C164.25 184.968 160.218 189 155.25 189C150.282 189 146.25 184.968 146.25 180V164.25H130.5C125.532 164.25 121.5 160.218 121.5 155.25C121.5 150.282 125.532 146.25 130.5 146.25H146.25V130.5C146.25 125.532 150.282 121.5 155.25 121.5C160.218 121.5 164.25 125.532 164.25 130.5V146.25H180C184.968 146.25 189 150.282 189 155.25C189 160.218 184.968 164.25 180 164.25Z"
                        fill="#00A0A0"
                        fillOpacity="0.2"
                    />
                </svg>
            </div>
        </div>
    );
};

export default ObjectsNewAbout;
